# Taps
tap "fluxcd/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"

# General dev
brew "node"
brew "docker", link: false
brew "go"
brew "python"
brew "ansible"
brew "terraform"
brew "jq"
brew "go-task/tap/go-task"
brew "direnv"
brew "ipcalc"
brew 'mas'
brew "mackup"
cask "visual-studio-code"
cask "tabby"
cask "microsoft-remote-desktop"

# Git
brew "git"
brew "pre-commit"
brew "prettier"
brew "gitleaks"

# Kubernetes
brew "kubernetes-cli"
brew "kubeval"
brew "kustomize"
brew "helm"
brew "fluxcd/tap/flux"
brew "sops"
cask "lens"

# Media
cask "plex"
cask "plexamp"
cask "spotify"

# Social
cask "discord"
cask "messenger"

# Security
brew "age"

# Productivity 
cask "ticktick"
cask "notion"
mas "Day One", id: 1055511498

# Apps
cask "alt-tab"
cask "firefox"
cask "nextcloud"





